Tekla.Structures.Geometry3d.Matrix
The Matrix class represents a 4x3 matrix.

Tekla.Structures.Geometry3d.Matrix.Transformation
The transformation.

Tekla.Structures.Geometry3d.Matrix.Item(System.Int32,System.Int32)
Sets or gets the matrix element values.
row: The matrix row index (0-3).
column: The matrix column index (0-2).
Returns: The value at the specified index.

Tekla.Structures.Geometry3d.Matrix.#ctor
Creates a new indentity matrix.

Tekla.Structures.Geometry3d.Matrix.#ctor(Tekla.Structures.Geometry3d.Matrix)
Creates a new matrix which is a copy of the given matrix.
m: The matrix to copy from.

Tekla.Structures.Geometry3d.Matrix.Transpose
Transposes a matrix. The resulting matrix is an inversion of the current matrix,
if the current matrix was a valid rotation matrix.

Tekla.Structures.Geometry3d.Matrix.GetTranspose
Returns a new matrix which is a transpose of the current matrix.
The transposed matrix is an inversion of the current matrix,
if the current matrix was a valid rotation matrix.
Returns: The new transposed matrix.

Tekla.Structures.Geometry3d.Matrix.op_Multiply(Tekla.Structures.Geometry3d.Matrix,Tekla.Structures.Geometry3d.Matrix)
Multiplies (combines) two transformation matrices.
B: The transformation matrix which is applied second.
A: The transformation matrix which is applied first.
Returns: The new compound transformation matrix.

Tekla.Structures.Geometry3d.Matrix.Transform(Tekla.Structures.Geometry3d.Point)
Transforms the given point using the current matrix.
p: The point to be transformed.
Returns: The new transformed point.

Tekla.Structures.Geometry3d.Matrix.op_Multiply(Tekla.Structures.Geometry3d.Matrix,Tekla.Structures.Geometry3d.Point)
Transforms the given point using the given matrix.
A: The transformation matrix.
p: The point to be transformed.
Returns: The new transformed point.

Tekla.Structures.Geometry3d.Matrix.ToString
Returns a string that represents the current matrix.
Returns: The string that represents the current matrix.